---
kind: method
id: M:Autodesk.Revit.DB.PointOnEdge.GetEdgeReference
source: html/f3470aef-6e30-bc3c-89c3-e293cb618e00.htm
---
# Autodesk.Revit.DB.PointOnEdge.GetEdgeReference Method

Get a copy of the edge or curve reference.

## Syntax (C#)
```csharp
public Reference GetEdgeReference()
```